const WhatsNewEnum = [{
	title: 'Оновлення від 02.06.2025',
	content: `# Спосіб оплати Trustypay EU
	1. Знижено комісію системи
	2. Виплати тільки на Криптогаманець у криптовалюті USDT (TRC20)
	`
}, {
	title: 'Оновлення від 05.05.2025',
	content: `Повідомлення про донати з платіжних інтеграцій (Банка, Конверт, Манібокс, API) стають платними з 10 травня 2025.

	Усі кошти спрямовуються на стабільну роботу та розвиток платформи.
    `
}, {
    title: 'Оновлення від 04.04.2025',
	content: `1. АІ голоси: 3 нові класні голоси для читання сповіщень.
    2. Підписки: лічильник успішних оплат (у віджеті та у списку донатів).
    3. API - підписники.
    4. Дизайн виплат.
    5. Платіжна інтеграція з Cardpay.
    5. Різні покращення та виправлення.
    `
}, {
	title: 'Оновлення від 04.02.2025',
	content: `# Партнерська програма і спосіб оплати Donatello
	1. Донати та підписки від 10₴. Усі країни, усі картки.
	2. Виплати на IBAN-рахунок автора.
	3. Сплата податків за авторів фізичних осіб.
	4. Підключення ФОП та юр. осіб без власного мерчанта.
    5. Надання звітів і актів виконаних робіт.
    6. Допомога професійним авторам при переході на ФОП.
    7. Безкоштовна бухгалтерія перші три місяці для нових ФОП.
    `
}, {
	title: 'Оновлення від 15.11.2024',
	content: `1. Коло Вибору: запуск після обраної суми, а не після кожного донату.
    2. Підписники: модерація підписників вашим модератором.
    `
}, {
	title: 'Оновлення від 23.10.2024',
	content: `1. Нові віджети збору коштів.
    2. Інтерактивний віджет "Коло вибору" (бета).
    3. Редизайн сторінки списку підписок.
    4. Загальні покращення.
    `
}, {
	title: 'Оновлення від 16.09.2024',
	content: `1. Підписка на будь-яку суму.
    2. Донат-сторінка: вибір глядачем голосу озвучки повідомлення.
    3. Редизайн створення публікацій.
	4. Телеграм-бот зі сповіщеннями для глядача.
    `
}, {
	title: 'Оновлення від 16.08.2024',
	content: `1. Віджет Сповіщення: відображення сповіщення якщо донат входить у межі мін-макс сум підвіджетів. (Корисно, якщо глядачі донатять 1грн, а у тебе мін донат 5 чи 10грн). Потрібно увімкнути у налаштуваннях Віджета.
	2. Доступна зміна дати початку статистики на твій вибір (Корисно для донат сторінки TOP-5 та віджетів Статистика).
    3. Сповіщення у Телеграм бот про нову публікацію твоїм підписникам.
    4. Можливість показати одразу сповіщення на екран, навіть якщо у вас включена Затримка сповіщень.
	5. Показувати суму у віджеті Статистика без комісії.
    6. Клонування основного віджета.
    7. Редизайн сторінки "Мої підписники".
    8. Показ назви замовленого відео з Youtube у списку донатів.
    `
}, {
	title: 'Оновлення від 16.08.2024',
	content: `1. Інтеграція з бізнес-мерчантом WayForPay для усіх користувачів.
	2. Способи оплати: детальний опис комісії, мінімальних сум донатів.
	3. Дрібні покращення та виправлення.
    `
}, {
	title: 'Оновлення від 18.07.2024',
	content: `1. Опція вимкнення способу оплати TrustyPay (Visa/Mastercard UA, Mastercard EU).
	2. Підсвічення вашої аватарки на донат-сторінці під час стріму.
	3. Віджет збору коштів: опція додати опис про збір на донат-сторінці.
    `
}, {
	title: 'Оновлення від 16.07.2024',
	content: `1. Інтеграція з TrustyPay (Visa/Mastercard UA, Mastercard EU).
	2. Повторення відео в інтерактивному віджеті без сповіщення про донат (Сторінка - Донати).
	3. Опція вимкнути фільтр повідомлень із забороненими словами.
	4. Читання тексту повністю у віджеті сповіщення.
    `
}, {
	title: 'Оновлення від 31.05.2024',
	content: `1. Донати і підписки на власний ФОП/ТОВ.
	2. Інтеграція з WayForPay (ФОП/ТОВ).
	3. Поновлення підписки зі зміною картки.
	4. Виправлення помилок.
    `
}, {
	title: 'Оновлення від 30.04.2024',
	content: `# Призупинення донатів і виплат через Fondy

У нас неприємна новина. Fondy виключили з реєстру платіжних систем.
Ми змушені призупинити донати і виплати через цей спосіб оплати.
Щойно буде можливість виплатити донати, що залишилися, ми про це відразу повідомимо.

Але є криптодонати і монобанка! Працюємо над інтеграцією інших платіжних систем.
    `
}, {
    title: 'Оновлення від 23.04.2024',
    content: `1. Замовлення кліпів Youtube: додано заборонені посилання.
    `
}, {
    title: 'Оновлення від 23.04.2024',
    content: `1. Донат сторінка: акцент на регулярних підписках для блогерів.
    2. Віджет збору коштів: градіент для діаграми.
    3. Підписники: сортування по даті створення/скасування підписки.
    `
}, {
    title: 'Оновлення від 18.04.2024',
    content: `1. Віджет статистики: TOP DJ (замовлення музики).
    2. Сторінка Підписники: Пошук, сортування, надсилання повідомлення.
    `
}, {
    title: 'Оновлення від 12.04.2024',
    content: `1. Віджет статистики: кількість та список підписників.
    2. Донат сторінка: опція вимкнути форму одноразового донату.
    3. Віджет збору коштів: QR код у діаграмі та шкалі збору.
    4. Віджет збору коштів: опція приховати знак валюти.
    5. Віджет сповіщень: термін анімації.
    6. Мої повідомлення: emoji у чаті.
    7. Посилання на соц мережі: покращено валідацію при збереженні.
    8. Виправлення помилок.
    `
}, {
    title: 'Оновлення від 29.03.2024',
    content: `1. Текст подяки за донат (Сторінка - Текст подяки).
    2. Редизайн сторінки «Повідомлення» для автора.
    3. Виправлено помилку відображення двох і більше джерел для віджета сповіщень.
    `
}, {
    title: 'Оновлення від 13.03.2024',
    content: `1. Валюта для рівнів підписки.
    2. Розіграші. Опція не брати участь переможцям у подальшому розіграші.
    3. Бібліотека Донателло: графіка, лого, конструктор QR коду.
    4. Покращення сторінки з публікаціями.
    `
}, {
    title: 'Оновлення від 06.03.2024',
    content: `1. Discord bot. Видача ролей вашим підписникам. Налаштування у рівнях підписок.
    2. Загальні виправлення.
	`
}, {
    title: 'Оновлення від 26.02.2024',
    content: `1. Віджет збору коштів: інтеграція з Конвертом.
	`
}, {
	title: 'Оновлення від 21.02.2024',
	content: `1. Криптодонати.
	2. Стрічка новин для глядача.
	`
}, {
    title: 'Оновлення від 08.02.2024',
    content: `1. Новий шаблон "Прогрес бар" для віджета "Збір коштів".
    2. Редизайн Кабінету (в процесі).
    `
}, {
    title: 'Оновлення від 03.02.2024',
    content: `1. Вибір валют на донат-сторінці (UAH, USD, EUR).
    2. Показ донатів у валюті.
    3. Вибір валют у віджетах збору коштів.
    4. Роль "Блогер" (підписки, регулярні донати) тепер доступна для базового рівня.
    `
}, {
	title: 'Оновлення від 19.01.2024',
	content: `1. Вибір глядачами Tenor анімації на донат сторінці.
    `
}, {
	title: 'Оновлення від 09.01.2024',
	content: `1. Додатковий контроль видимості YouTube відео в "Окремому вікні" донатів.
    2. Опція перейменувати один або всі донати.
    3. Віджет сповіщення: горизонтальне вирівнювання тексту.
    4. Блогер: можливість призупинити підписку певного користувача.
    `
}, {
	title: 'Оновлення від 04.01.2024',
	content: `1. Зміна назв у статусах. Тепер "партнер" — це "досвідчений", а "vip" — "партнер". Умови статусів без змін.
    2. Опція призупинити відтворення донатів.
    3. Підсвічення нових донатів у новому вікні.
    4. Публікації (блогер): хто переглянув, вподобав публікацію.
    5. Вебхуки (вхідний API) - валідація параметрів, виправлено помилки.
    6. Колбеки (вихідний API) - збільшено ліміти неуспішних запитів, логування, імейл про вимкнення, виправлено помилки.
    `
}, {
	title: 'Оновлення від 16.12.2023',
	content: `1. Редизайн Кабінету (в процесі).
    2. Виплати: додаткові пояснення, чому виплата скасована.
    3. Віджет збору коштів: додавати чи ні суму підписки до віджета.
    4. Віджет збору коштів: опція приховати суму на донат сторінці.
    `
}, {
	title: 'Оновлення від 10.11.2023',
	content: `1. Творчість: чати з підписниками.
    2. Глядач: оновлено Мої підписки.
	3. Донати: редагування імені донаторів (доступно з середнього рівня).
    `
}, {
	title: 'Оновлення від 28.10.2023',
	content: `1. Публікації: додавання зображень.
	2. Віджет збору коштів: можливість додавання суми без комісії.
    `
}, {
	title: 'Оновлення від 16.10.2023',
	content: `1. Розіграші серед донаторів.
	2. Віджети: виправлено тінь тексту.
    3. Віджет ТОП: фільтр заборонених слів.
    4. Віджет збору коштів: готові шаблони для діаграми та збереження пресетів.
    5. Віджет збору коштів: автоматичне збільшення цілі збору при її досягненні.
    6. Оновлення для статусу "Бізнес".
    `
}, {
	title: 'Оновлення від 19.09.2023',
	content: `1. Інтеграція з власним мерчантом (Бізнес).
	2. Віджет сповіщення: AI голоси читання тексту (Партнер, VIP).
    3. Редизайн Кабінету (в процесі).
    `
}, {
    title: 'Оновлення від 13.09.2023',
    content: `1. Усі віджети: додали обводку тексту.
    2. Віджет сповіщення: повернули вибір рендомних анімацій та звуків.
    3. Модерація донатів: затримка у відображенні (від 0 до 60 секунд).
    `
}, {
    title: 'Оновлення від 30.08.2023',
    content: `1. Голосові донати. Налаштовуються у віджеті сповіщення.
    `
}, {
    title: 'Оновлення від 22.08.2023',
    content: `1. Інтеграції: додано назву збору.
    `
}, {
    title: 'Оновлення від 20.08.2023',
    content: `1. Додані Tenor анімації на вибір.
    `
}, {
    title: 'Оновлення від 11.08.2023',
    content: `1. Пост на окремій сторінці та з прямим посиланням.
    2. Розсилка повідомлень по рівнях.
    3. Статистика на донат-сторінці: кількість підписників, суми регулярних донатів.
    4. Українська мова у редакторі тексту.
    5. Секція "Про автора" для ролі "Стрімер".
    6. Пост: можна розміщувати посилання на YouTube відео у самому тексті.
    7. Збір коштів: виправлено помилку з пересуванням віджета.
    8. Загальні виправлення та покращення.
    `
}, {
    title: 'Оновлення від 24.07.2023',
    content: `1. Видалення користувача.
    2. Віджет сповіщення: повідомлення про підписку.
    3. Віджет сповіщення: виправлено відображення відео.
    `
}, {
    title: 'Оновлення від 15.06.2023',
    content: `1. Ролі користувачів: стрімер, блогер, глядач.
    2. Реєстрація, профіль і налаштування для глядачів.
    3. Підписки, підписники, публікації, повідомлення.
    `
}, {
    title: 'Оновлення від 05.06.2023',
    content: `1. Оптимізовано публікацію тестових повідомлень в OBS.
    2. Новий шаблон "Діаграма" для віджета "Збір коштів".
    3. Послуги для статусу "Досвідчений" зменшено до 3%.
    `
}, {
    title: 'Оновлення від 29.05.2023',
    content: `1. Віджет "Таймер". (див. Інтерактивні віджети).
    2. Затримка сповіщень для модерації (див. Налаштування).
    `
}, {
    title: 'Оновлення від 22.02.2023',
    content: `1. Нова версія донат-сторінки (beta).
    2. Темна тема на новій донат-сторінці.
    3. Вхід у кабінет через YouTube.
    4. Показ стрімерів YouTube на головній сторінці сайту ("Зараз з нами", "Наживо").
    `
}, {
    title: 'Оновлення від 06.12.2022',
    content: `1. Способи оплати: Fondy, Моно банка (партнери, vip).
    `
}, {
    title: 'Оновлення від 15.11.2022',
    content: `1. Виплати. Дострокове підтвердження зміни картки через імейл (досвідчені, партнери, vip).
    2. Віджет топ-донаторів. Можливість вибирати власний період часу для розрахунку топ-донаторів.
    `
}, {
    title: 'Оновлення від 24.10.2022',
    content: `1. Виплати частинами: автор сам вибирає суму донатів для виплати.
    2. Донат-сторінка: повідомлення для відвідувачів з країн-агресорів, що оплата донатів з їхніх країн неможлива.
    3. Заборонені слова: покращено алгоритм заміни, функція видалення усього слова.
    `
}, {
    title: 'Оновлення від 2.10.2022',
    content: `1. Донат сторінка: донат без коментаря.
    `
}, {
    title: 'Оновлення від 28.09.2022',
    content: `1. Інтерактивний віджет: плеєр у "Донати - Нове вікно" для контролю відео.
    2. Пошук донатів по імені, даті чи сумі.
    3. Експорт донатів у CSV файл.
    4. Покращено відображення статусів.
    `
}, {
    title: 'Оновлення від 09.09.2022',
    content: `1. Віджет сповіщення: виправлено вибір анімації та звуків на донат-сторінці.
    2. Віджет сповіщення: додано конкретну суму для відображення донату.
    `
}, {
    title: 'Оновлення від 27.08.2022',
    content: `1. Інтерактивний віджет: додано назву відео та імя донатора.
    2. Збір коштів: можливість відображати картинку над текстом.
    3. Додано кнопку у секцію Донати "Позначити всі повідомлення як переглянуті".
    3. Додано нотатку про тривалість YouTube відео.
    `
}, {
    title: 'Оновлення від 20.08.2022',
    content: `1. Віджет сповіщення: можна змінити гучність читання.
    `
}, {
    title: 'Оновлення від 09.08.2022',
    content: `1. Донат-сторінка: власна назва у заголовку (по-замовчуванню, нікнейм).
    2. Інтерактивний віджет: показ доната одразу, не чекаючи закінчення відео.
    `
}, {
    title: 'Оновлення від 01.08.2022',
    content: `1. Збір коштів: продовжувати збір при досягненні кінцевої суми та показувати відсотки більше 100%.
    2. Віджет статистики: позиція тексту слайдера.
    3. Новий шрифт "Poiret One".
    `
}, {
    title: 'Оновлення від 28.07.2022',
    content: `1. Збір коштів: додано мульти-цілі.
    2. Донати: можливість приховати ім'я донатора і текст повідомлення (бан).
    3. Сторінка донатів: останні повідомлення.
    4. Авторизація з Trovo.
    `
}, {
    title: 'Оновлення від 20.07.2022',
    content: `1. Збір коштів: додано роздільник та анімації до смуги донатів.
    2. Топ-віджет: додано виділення суми донату.
    `
}, {
    title: 'Оновлення від 25.06.2022',
    content: `1. Віджет збору коштів: можливість зберігати пресети своїх віджетів.
    2. Стрічка донатів: посилання на відео з інтерактивного віджета.
    `
}, {
    title: 'Оновлення від 10.06.2022',
    content: `1. Віджет збору коштів: покращено відображення віджета, розвернутого на 90°.
    2. Віджет збору коштів: додано {start} {end} до назви.
    3. Віджет збору коштів: додано нові готові налаштування.
    4. Віджет сповіщення: покращено налаштування елементів віджета.
    5. Віджет сповіщення: додано зупинку музики разом зі сповіщенням.
    6. Покращено "Заборонені слова" (великі/маленькі букви).
    7. Виправлення проблеми з відтворенням відео YouTube.
    8. Донателло API: активація і документація.
    9. Можливість згенерувати новий токен для посилань на віджети.
    `
}, {
    title: 'Оновлення від 19.05.2022',
    content: `1. Віджет сповіщення: можливість виділяти ім'я донатора та суму донату.
    2. Віджет сповіщення: додано градіент до тексту.
    4. Віджет збору коштів: можливість змінити текст після 100% збору.
    5. Огляд: додаткові графіки з фільтрацією користувачів.
    6. Інтеграція зі StreamElements: публікація донатів (експериментальний функціонал).
    `
}, {
    title: 'Оновлення від 27.04.2022',
    content: `1. Покращена сторінка Огляд.
    `
}, {
    title: 'Оновлення від 20.04.2022',
    content: `1. Можливість глядачам замовляти відео з YouTube.
    2. Telegram бот для отримання сповіщень про донати.
    3. Discord: можливість зміни тексту для повідомлення.
    4. Донат-сторінка: посилання на соціальні мережі.
    5. Озвучення донату: англійська мова (три варіанти).
    6. Покращення функції "приховати URL у донаті".
    7. Загальні покращення інтерфейсу.
    `
}, {
    title: 'Оновлення від 27.03.2022',
    content: `1. Авторизація та інтеграція з Discord.
    2. Повідомлення про донат на Discord-сервер.
    3. Вибір мови донат-сторінки (українська, англійська).
    4. Безпека: блокування виплат на 24 години після зміни картки.
    `
}, {
    title: 'Оновлення від 30.01.2022',
    content: `1. Додано можливість глядачу обрати звук та анімацію на сторінці донату (залежить від певної суми).
    2. Додано кут градіента та ширина стінки віджета Збору коштів.
    3. Призупинення віджета збору коштів.
    4. Додано групування до налаштувань віджетів.
    5. Покращено завантаження файлів.
    `
}, {
    title: 'Оновлення від 09.12.2021',
    content: `1. Сторінка донату: додано опис та кастомізацію (@Survager).
    2. Можливість приховувати URL у донат повідомленні (@ceh9).
    3. Віджет збору коштів: додано анімації (немає, постійна, коли отримано донат) (@pad0n).
    4. Збір коштів: додано сортування (@pad0n).
    5. Гучність донату (виправлення) (@ceh9).
    6. Інші виправлення та покращення.
    `
}, {
    title: 'Оновлення від 02.10.2021',
    content: `1. Віджет збору коштів: анімація тексту.
    2. Віджет збору коштів: колірна гама (градієнт) та її анімація. Додавайте декілька кольорів!
    3. Зменшена комісія сервісу для статусів "Друг", "Партнер", "VIP" (4.5%, 4% і 3% відповідно).
    4. Перехід у статус "Базовий", "Друг", "Партнер", "VIP" після досягнення певної суми донатів.
    5. Нові акаунти: скасовано демо-режим і верифікацію, але введено щоденний ліміт донатів.
    6. Можливість донаторові оплатити комісію за автора.
    `
}, {
    title: 'Оновлення від 31.08.2021',
    content: `1. Віджет сповіщення: довільне розташування елементів, перетягування і зміна розміру.
    2. Позначка "New" для нового функціоналу.
    3. Віджет сповіщення: анімація при появі та зникненні.
    4. Віджети: нові анімації.
    5. Донат-сторінка: зміна кольору тексту.
    6. Виправлення: появлення тіней у тексті.
    7. Виправлення вибір стандартних медіа файлів.
    `
}, {
    title: 'Оновлення від 10.06.2021',
    content: `1. Виправлення: загальна статистика.
    2. Виправлення: статистика розподілу, графіки.
    `
}, {
    title: 'Оновлення від 06.06.2021',
    content: `1. Збір коштів на різні цілі одночасно (@pad0n).
    2. Можливість вибрати ціль збору коштів на сторінці донатів.
    3. Окреме посилання на сторінку збору коштів.
    4. Обмеження символів у повідомленнях донатів (@arusenti).
    5. Читання тексту: нове API без лімітів на кількість символів.
    6. Виправлення: віджет сповіщень, сторінка донатів.
    `
}, {
    title: 'Оновлення від 16.04.2021',
    content: `1. Пропуск повідомлення, яке відображається наживо - віджет сповіщення (@Yavoroshko).
    2. Можливість ховати початкову і кінцеву суми у віджеті збору коштів (@Darkness_in_ass).
    3. Статус сторінки: демо, базовий, партнер, vip.
    4. Частковий перехід на нову платіжну систему.
    `
}, {
    title: 'Оновлення від 25.02.2021',
    content: `1. Перекази: за запитом (від 100) і в автоматичному режимі (від 2000).
    2. Повідомлення на ел. пошту про виконані перекази.
    3. Оновлення бокового меню в панелі налаштувань.
    4. Адаптивний дизайн: смартфон, планшет, десктоп.
    5. Темна тема.
    `
}, {
    title: 'Оновлення від 20.01.2021',
    content: `1. Видалення тестового повідомлення зі списку донатів (itmentor).
    2. Виправлено підписників на віджеті Twitch (Darkness_in_ass).
    3. Додано підтримку відео WEBM і MP4 (Neloriand, Deltachhh).
    4. Дозволено редагувати віджет збору коштів (Yavoroshko).
    5. Можливість самостійно налаштовувати розташування елементів у віджеті.
    6. Загальні виправлення.
    `
}, {
    title: 'Оновлення від 10.10.2020',
    content: `1. Що нового.
    2. QR-код на донат-сторінці.
    3. Редагування сум на кнопках донату.
    5. Статистика (топ підписників) на сторінці донату (опціонально).
    6. Картинка позаду тексту - віджет сповіщення.
    7. Виправлено статистику.
    8. Віджет збору коштів - цифри іншого кольору.`
}];

export default WhatsNewEnum;
